summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxMcds_bf.h
/**
 * \file IfxMcds_bf.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Mcds_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxLld_Mcds
 * 
 */
#ifndef IFXMCDS_BF_H
#define IFXMCDS_BF_H
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mcds_BitfieldsMask
 * \{  */

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIQ0 */
#define IFX_MCDS_ACT_AIQ0_LEN (2)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIQ0 */
#define IFX_MCDS_ACT_AIQ0_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIQ0 */
#define IFX_MCDS_ACT_AIQ0_OFF (5)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIQ1 */
#define IFX_MCDS_ACT_AIQ1_LEN (2)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIQ1 */
#define IFX_MCDS_ACT_AIQ1_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIQ1 */
#define IFX_MCDS_ACT_AIQ1_OFF (13)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIQ2 */
#define IFX_MCDS_ACT_AIQ2_LEN (2)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIQ2 */
#define IFX_MCDS_ACT_AIQ2_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIQ2 */
#define IFX_MCDS_ACT_AIQ2_OFF (21)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIQ3 */
#define IFX_MCDS_ACT_AIQ3_LEN (2)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIQ3 */
#define IFX_MCDS_ACT_AIQ3_MSK (0x3)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIQ3 */
#define IFX_MCDS_ACT_AIQ3_OFF (29)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIS0 */
#define IFX_MCDS_ACT_AIS0_LEN (5)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIS0 */
#define IFX_MCDS_ACT_AIS0_MSK (0x1f)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIS0 */
#define IFX_MCDS_ACT_AIS0_OFF (0)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIS1 */
#define IFX_MCDS_ACT_AIS1_LEN (5)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIS1 */
#define IFX_MCDS_ACT_AIS1_MSK (0x1f)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIS1 */
#define IFX_MCDS_ACT_AIS1_OFF (8)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIS2 */
#define IFX_MCDS_ACT_AIS2_LEN (5)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIS2 */
#define IFX_MCDS_ACT_AIS2_MSK (0x1f)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIS2 */
#define IFX_MCDS_ACT_AIS2_OFF (16)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.AIS3 */
#define IFX_MCDS_ACT_AIS3_LEN (5)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.AIS3 */
#define IFX_MCDS_ACT_AIS3_MSK (0x1f)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.AIS3 */
#define IFX_MCDS_ACT_AIS3_OFF (24)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.LV0 */
#define IFX_MCDS_ACT_LV0_LEN (1)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.LV0 */
#define IFX_MCDS_ACT_LV0_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.LV0 */
#define IFX_MCDS_ACT_LV0_OFF (7)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.LV1 */
#define IFX_MCDS_ACT_LV1_LEN (1)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.LV1 */
#define IFX_MCDS_ACT_LV1_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.LV1 */
#define IFX_MCDS_ACT_LV1_OFF (15)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.LV2 */
#define IFX_MCDS_ACT_LV2_LEN (1)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.LV2 */
#define IFX_MCDS_ACT_LV2_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.LV2 */
#define IFX_MCDS_ACT_LV2_OFF (23)

/** \\brief  Length for Ifx_MCDS_ACT_Bits.LV3 */
#define IFX_MCDS_ACT_LV3_LEN (1)

/** \\brief  Mask for Ifx_MCDS_ACT_Bits.LV3 */
#define IFX_MCDS_ACT_LV3_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_ACT_Bits.LV3 */
#define IFX_MCDS_ACT_LV3_OFF (31)

/** \\brief  Length for Ifx_MCDS_CLC_Bits.DISR */
#define IFX_MCDS_CLC_DISR_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CLC_Bits.DISR */
#define IFX_MCDS_CLC_DISR_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CLC_Bits.DISR */
#define IFX_MCDS_CLC_DISR_OFF (0)

/** \\brief  Length for Ifx_MCDS_CLC_Bits.DISS */
#define IFX_MCDS_CLC_DISS_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CLC_Bits.DISS */
#define IFX_MCDS_CLC_DISS_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CLC_Bits.DISS */
#define IFX_MCDS_CLC_DISS_OFF (1)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.CLR0 */
#define IFX_MCDS_CNT_CCL_CLR0_LEN (6)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.CLR0 */
#define IFX_MCDS_CNT_CCL_CLR0_MSK (0x3f)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.CLR0 */
#define IFX_MCDS_CNT_CCL_CLR0_OFF (8)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.CLR1 */
#define IFX_MCDS_CNT_CCL_CLR1_LEN (6)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.CLR1 */
#define IFX_MCDS_CNT_CCL_CLR1_MSK (0x3f)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.CLR1 */
#define IFX_MCDS_CNT_CCL_CLR1_OFF (24)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.CLV0 */
#define IFX_MCDS_CNT_CCL_CLV0_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.CLV0 */
#define IFX_MCDS_CNT_CCL_CLV0_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.CLV0 */
#define IFX_MCDS_CNT_CCL_CLV0_OFF (15)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.CLV1 */
#define IFX_MCDS_CNT_CCL_CLV1_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.CLV1 */
#define IFX_MCDS_CNT_CCL_CLV1_MSK (0x1)

/** \\brief  Offset for Ifx_MCDS_CNT_CCL_Bits.CLV1 */
#define IFX_MCDS_CNT_CCL_CLV1_OFF (31)

/** \\brief  Length for Ifx_MCDS_CNT_CCL_Bits.ILV0 */
#define IFX_MCDS_CNT_CCL_ILV0_LEN (1)

/** \\brief  Mask for Ifx_MCDS_CNT_CCL_Bits.ILV0 */
#define IFX_MCDS_CNT_CCL_ILV0_MSK (0x1)

